# Задайте список. Напишите программу, 
# которая определит, присутствует ли в 
# заданном списке строк некое число.


list_number = [1, 2, 3, 4]

#for element in list_number:
if 1 in list_number:
    print('Есть')
else:
    print('Нет')