
# 4- Определить, позицию второго вхождения строки в списке 
# либо сообщить, что её нет.
# Примеры
# список: ["qwe", "asd", "zxc", "qwe", "ertqwe"], 
# ищем: "qwe", ответ: 3
# список: ["йцу", "фыв", "ячс", "цук", "йцукен", "йцу"], 
# ищем: "йцу", ответ: 5
# список: ["йцу", "фыв", "ячс", "цук", "йцукен"], 
# ищем: "йцу", ответ: -1
# список: ["123", "234", 123, "567"], 
# ищем: "123", ответ: -1
# список: [], ищем: "123", ответ: -1

from os import system
system("cls")

import function as fun


# lines = ["qwe", "asd", "zxc", "qwe", "ertqwe"]
# elem = 'qwe'
lines = [input('Введите элемент массива:') for _ in range (fun.get_number('Введите размер списка: '))]
elem = input('Введите элемент для поиска: ')
res = [y for x, y in zip(lines, list(range(len(lines)))) if  x == elem]
if len(res) > 1:
    print(res[1])
else:
    print('Нет второго вхождения')

