
# 4- Определить, позицию второго вхождения строки в списке 
# либо сообщить, что её нет.
# Примеры
# список: ["qwe", "asd", "zxc", "qwe", "ertqwe"], 
# ищем: "qwe", ответ: 3
# список: ["йцу", "фыв", "ячс", "цук", "йцукен", "йцу"], 
# ищем: "йцу", ответ: 5
# список: ["йцу", "фыв", "ячс", "цук", "йцукен"], 
# ищем: "йцу", ответ: -1
# список: ["123", "234", 123, "567"], 
# ищем: "123", ответ: -1
# список: [], ищем: "123", ответ: -1
from os import system
system("cls")

string = ["qwe", "asd", "zxc", "qwe", "ertqwe"]
res = [y for x, y in zip(string, list(range(len(string)))) if  x == 'qwe']
if len(res) > 1:
    print(res[1])
else:
    print('Нет второго вхождения')

